In [1]:
import numpy as np
import pandas as pd

In [3]:
df1 = pd.DataFrame({"CNIC":np.random.randint(1,20,size=20),
                   "Account No":np.random.randint(1,5,size=(20))})
df1

    CNIC  Account No
0      1           2
1      3           3
2     16           1
3      4           3
4     19           2
5      3           3
6     10           1
7     15           2
8     19           2
9      7           2
10     6           4
11     9           3
12     9           2
13     2           1
14    11           4
15    11           2
16    15           2
17    18           4
18    18           2
19    12           4

In [5]:
df2 = pd.DataFrame({"CNIC":np.random.randint(1,20,size=20),
                   "Account No":np.random.randint(1001,2000,size=(20)),
                   "Mobile no":np.random.randint(1000000,2000000,size=(20)),
                   "DOB":pd.date_range(start='1/1/1990', periods=20),
                   "Customer Name":pd.util.testing.rands_array(10, 20),
                   "Gender":np.random.choice(["Male","Female"],size=20)
                                       })
df2

    CNIC  Account No  Mobile no        DOB Customer Name  Gender
0      4        1836    1365096 1990-01-01    0nesw0vdlB  Female
1     17        1147    1480986 1990-01-02    BiQonqpIBD  Female
2      4        1054    1557883 1990-01-03    PVWXCE9zC5    Male
3      8        1057    1133029 1990-01-04    IEKK52HOHk    Male
4      6        1956    1962576 1990-01-05    tYFT7yNnNC  Female
5      7        1399    1938657 1990-01-06    eMqR3viOAF  Female
6     10        1814    1352263 1990-01-07    NzBIsfX2MM  Female
7      2        1140    1837409 1990-01-08    jDMXLEczaT  Female
8      7        1275    1533963 1990-01-09    8r1zZNI8Je    Male
9     12        1101    1377277 1990-01-10    g119nQuBex    Male
10    11        1728    1436571 1990-01-11    zCflQ3fNS4    Male
11     1        1722    1530398 1990-01-12    ozZxvaNvXh    Male
12    17        1744    1215443 1990-01-13    5r4eumzPCD    Male
13    14        1346    1075506 1990-01-14    dmQ7aCnUyt  Female
14     9        1169    1977412 1990-01-15    iirjPr61yK    Male
15     5        1087    1336472 1990-01-16    x1WYBwrWUP    Male
16     5        1051    1972528 1990-01-17    Pa0UvL2ZZ0  Female
17    13        1381    1824029 1990-01-18    gSgGLHgSRT    Male
18     7        1996    1993871 1990-01-19    ZkZw612idE  Female
19    15        1962    1573266 1990-01-20    QNS4gGyV2X    Male

# 7.1 Handling Missing Data

In [6]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [7]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [8]:
string_data[0] = None

In [9]:
string_data

0         None
1    artichoke
2          NaN
3      avocado
dtype: object

In [10]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [12]:
from numpy import nan as NA
data = pd.Series([1,NA,3.5,NA,7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [13]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [14]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],[NA, NA, NA], [NA, 6.5, 3.]])
cleaned = data.dropna()
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [15]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [16]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [17]:
data.dropna(1,how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [18]:
df = pd.DataFrame(np.random.randn(7, 3))
df

          0         1         2
0 -0.331911 -0.323670  0.992300
1  0.220910  0.020750 -1.439247
2  0.174775 -0.462359  1.082368
3  0.769553 -0.302356 -2.012912
4  0.342876 -1.158405  1.651600
5  2.684140  0.173281 -0.541822
6  0.088943  0.517825 -0.157338

In [19]:
df.iloc[:4, 1] = NA
df.iloc[:2, 2] = NA
df

          0         1         2
0 -0.331911       NaN       NaN
1  0.220910       NaN       NaN
2  0.174775       NaN  1.082368
3  0.769553       NaN -2.012912
4  0.342876 -1.158405  1.651600
5  2.684140  0.173281 -0.541822
6  0.088943  0.517825 -0.157338

In [20]:
df.dropna()

          0         1         2
4  0.342876 -1.158405  1.651600
5  2.684140  0.173281 -0.541822
6  0.088943  0.517825 -0.157338

In [21]:
df.dropna(thresh=2)

          0         1         2
2  0.174775       NaN  1.082368
3  0.769553       NaN -2.012912
4  0.342876 -1.158405  1.651600
5  2.684140  0.173281 -0.541822
6  0.088943  0.517825 -0.157338

## Filling In Missing Data

In [22]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [23]:
df

          0         1         2
0 -0.331911       NaN       NaN
1  0.220910       NaN       NaN
2  0.174775       NaN  1.082368
3  0.769553       NaN -2.012912
4  0.342876 -1.158405  1.651600
5  2.684140  0.173281 -0.541822
6  0.088943  0.517825 -0.157338

In [24]:
df.fillna(0)

          0         1         2
0 -0.331911  0.000000  0.000000
1  0.220910  0.000000  0.000000
2  0.174775  0.000000  1.082368
3  0.769553  0.000000 -2.012912
4  0.342876 -1.158405  1.651600
5  2.684140  0.173281 -0.541822
6  0.088943  0.517825 -0.157338

In [25]:
data.fillna(1)

     0    1    2
0  1.0  6.5  3.0
1  1.0  1.0  1.0
2  1.0  1.0  1.0
3  1.0  6.5  3.0

In [26]:
df.fillna(3)

          0         1         2
0 -0.331911  3.000000  3.000000
1  0.220910  3.000000  3.000000
2  0.174775  3.000000  1.082368
3  0.769553  3.000000 -2.012912
4  0.342876 -1.158405  1.651600
5  2.684140  0.173281 -0.541822
6  0.088943  0.517825 -0.157338

In [27]:
df.fillna(7)

          0         1         2
0 -0.331911  7.000000  7.000000
1  0.220910  7.000000  7.000000
2  0.174775  7.000000  1.082368
3  0.769553  7.000000 -2.012912
4  0.342876 -1.158405  1.651600
5  2.684140  0.173281 -0.541822
6  0.088943  0.517825 -0.157338

In [28]:
df.fillna({1: 0.5, 2: 0})

          0         1         2
0 -0.331911  0.500000  0.000000
1  0.220910  0.500000  0.000000
2  0.174775  0.500000  1.082368
3  0.769553  0.500000 -2.012912
4  0.342876 -1.158405  1.651600
5  2.684140  0.173281 -0.541822
6  0.088943  0.517825 -0.157338

In [29]:
df.fillna(0, inplace=True)

In [30]:
df

          0         1         2
0 -0.331911  0.000000  0.000000
1  0.220910  0.000000  0.000000
2  0.174775  0.000000  1.082368
3  0.769553  0.000000 -2.012912
4  0.342876 -1.158405  1.651600
5  2.684140  0.173281 -0.541822
6  0.088943  0.517825 -0.157338

In [31]:
data.fillna(np.mean(data))

     0    1    2
0  1.0  6.5  3.0
1  1.0  6.5  3.0
2  1.0  6.5  3.0
3  1.0  6.5  3.0

In [32]:
np.mean(data)

0    1.0
1    6.5
2    3.0
dtype: float64

In [33]:
df.fillna(method='ffill')

          0         1         2
0 -0.331911  0.000000  0.000000
1  0.220910  0.000000  0.000000
2  0.174775  0.000000  1.082368
3  0.769553  0.000000 -2.012912
4  0.342876 -1.158405  1.651600
5  2.684140  0.173281 -0.541822
6  0.088943  0.517825 -0.157338

In [34]:
df.fillna(method='ffill', limit=2)

          0         1         2
0 -0.331911  0.000000  0.000000
1  0.220910  0.000000  0.000000
2  0.174775  0.000000  1.082368
3  0.769553  0.000000 -2.012912
4  0.342876 -1.158405  1.651600
5  2.684140  0.173281 -0.541822
6  0.088943  0.517825 -0.157338

In [35]:
df.fillna(method='bfill', limit=2)

          0         1         2
0 -0.331911  0.000000  0.000000
1  0.220910  0.000000  0.000000
2  0.174775  0.000000  1.082368
3  0.769553  0.000000 -2.012912
4  0.342876 -1.158405  1.651600
5  2.684140  0.173281 -0.541822
6  0.088943  0.517825 -0.157338

In [36]:
df.fillna(method='ffill', axis=1)

          0         1         2
0 -0.331911  0.000000  0.000000
1  0.220910  0.000000  0.000000
2  0.174775  0.000000  1.082368
3  0.769553  0.000000 -2.012912
4  0.342876 -1.158405  1.651600
5  2.684140  0.173281 -0.541822
6  0.088943  0.517825 -0.157338

In [38]:
df.fillna(method='bfill', axis=1)

          0         1         2
0 -0.331911  0.000000  0.000000
1  0.220910  0.000000  0.000000
2  0.174775  0.000000  1.082368
3  0.769553  0.000000 -2.012912
4  0.342876 -1.158405  1.651600
5  2.684140  0.173281 -0.541822
6  0.088943  0.517825 -0.157338

In [39]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],'k2': [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [40]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [42]:
data.drop_duplicates(subset="k1")

    k1  k2
0  one   1
1  two   1

In [43]:
data.drop_duplicates(subset="k1",keep='last')

    k1  k2
4  one   3
6  two   4

In [44]:
data.drop_duplicates(subset=["k1","k2"],keep='last')

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
6  two   4

## Transforming Data Using a Function or Mapping

In [45]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
 'Pastrami', 'corned beef', 'Bacon',
 'pastrami', 'honey ham', 'nova lox'],
 'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [46]:
meat_to_animal = {
'bacon': 'pig',
'pulled pork': 'pig',
'pastrami': 'cow',
'corned beef': 'cow',
'honey ham': 'pig',
'nova lox': 'salmon'
}
lowercased = data['food'].str.lower()
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [47]:
lowercased.map(meat_to_animal)
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [48]:
data['animal'] = lowercased.map(meat_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [49]:
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

## Replacing Values

In [50]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [51]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [52]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [55]:
data.replace(data[data<=-999], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [56]:
data.replace({-999: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [57]:
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

## Renaming Axis Indexes

In [58]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
    index=['Ohio', 'Colorado', 'New York'],
    columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [59]:
transform = lambda x: x[:4].upper()

In [60]:
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [61]:
data.index = data.index.map(transform)
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [62]:
data.columns.map(transform)

Index(['ONE', 'TWO', 'THRE', 'FOUR'], dtype='object')

In [63]:
data.columns = data.columns.map(transform)
data

      ONE  TWO  THRE  FOUR
OHIO    0    1     2     3
COLO    4    5     6     7
NEW     8    9    10    11

In [64]:
data.rename(index=str.title, columns=str.upper)

      ONE  TWO  THRE  FOUR
Ohio    0    1     2     3
Colo    4    5     6     7
New     8    9    10    11

In [70]:
data.rename(index={'OHIO': 'INDIANA'},columns={'THRE': 'peekaboo'})

         ONE  TWO  peekaboo  FOUR
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

## Discretization and Binning

In [71]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]
bins = [18, 25, 35, 60, 100]
cats = pd.cut(ages, bins)
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [72]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [73]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]],
              closed='right',
              dtype='interval[int64]')

In [74]:
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [75]:
pd.cut(ages, [18, 26, 36, 61, 100], right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [78]:
pd.value_counts(pd.cut(ages, [18, 25, 35, 60, 100], right=False))

[25, 35)     4
[18, 25)     4
[35, 60)     3
[60, 100)    1
dtype: int64

In [79]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']

In [80]:
pd.cut(ages, bins, labels=group_names)

[Youth, Youth, Youth, YoungAdult, Youth, ..., YoungAdult, Senior, MiddleAged, MiddleAged, YoungAdult]
Length: 12
Categories (4, object): [Youth < YoungAdult < MiddleAged < Senior]

In [83]:
data = np.random.rand(20)
pd.cut(data, 4, precision=2)

[(0.25, 0.49], (0.0064, 0.25], (0.49, 0.73], (0.25, 0.49], (0.25, 0.49], ..., (0.25, 0.49], (0.25, 0.49], (0.73, 0.97], (0.0064, 0.25], (0.0064, 0.25]]
Length: 20
Categories (4, interval[float64]): [(0.0064, 0.25] < (0.25, 0.49] < (0.49, 0.73] < (0.73, 0.97]]

In [84]:
pd.cut(data, 4, precision=2).value_counts()

(0.0064, 0.25]    6
(0.25, 0.49]      8
(0.49, 0.73]      2
(0.73, 0.97]      4
dtype: int64

In [85]:
data = np.random.randn(1000)
cats = pd.qcut(data, 4)
cats

[(0.635, 3.553], (-0.615, 0.036], (0.635, 3.553], (-0.615, 0.036], (-0.615, 0.036], ..., (0.036, 0.635], (-0.615, 0.036], (-0.615, 0.036], (0.635, 3.553], (0.635, 3.553]]
Length: 1000
Categories (4, interval[float64]): [(-3.951, -0.615] < (-0.615, 0.036] < (0.036, 0.635] < (0.635, 3.553]]

In [86]:
pd.value_counts(cats)

(0.635, 3.553]      250
(0.036, 0.635]      250
(-0.615, 0.036]     250
(-3.951, -0.615]    250
dtype: int64

## Detecting and Filtering Outliers

In [88]:
data = pd.DataFrame(np.random.randn(1000, 4))
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.015502    -0.017266    -0.011007    -0.008325
std       0.977531     1.034564     1.003755     0.956371
min      -3.016780    -3.378681    -3.334114    -3.242327
25%      -0.599715    -0.717765    -0.689045    -0.674907
50%       0.044262    -0.033709    -0.018438     0.032567
75%       0.621840     0.711520     0.631666     0.637740
max       2.964639     2.863414     3.306704     2.774219

In [89]:
col = data[2]
col[np.abs(col) > 3]

316    3.004974
523   -3.334114
899    3.306704
Name: 2, dtype: float64

In [90]:
data[(np.abs(data) > 3).any(1)]

            0         1         2         3
222  1.410440 -1.179525 -0.513303 -3.242327
316 -0.337778 -0.883088  3.004974  0.229254
343 -0.133277 -3.378681  0.022086  0.820994
453 -3.016780  0.663844  0.881619  0.950341
523  0.819601  2.171484 -3.334114  0.715802
770 -0.660764 -3.227680  0.402340  0.768445
899  1.190512 -0.574104  3.306704  0.699329

In [91]:
data[np.abs(data) > 3] = np.sign(data) * 3
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.015519    -0.016659    -0.010985    -0.008082
std       0.977479     1.032718     1.001718     0.955581
min      -3.000000    -3.000000    -3.000000    -3.000000
25%      -0.599715    -0.717765    -0.689045    -0.674907
50%       0.044262    -0.033709    -0.018438     0.032567
75%       0.621840     0.711520     0.631666     0.637740
max       2.964639     2.863414     3.000000     2.774219

In [92]:
np.sign(data).head()

     0    1    2    3
0 -1.0 -1.0 -1.0  1.0
1  1.0  1.0 -1.0 -1.0
2 -1.0  1.0 -1.0 -1.0
3 -1.0 -1.0 -1.0  1.0
4 -1.0 -1.0  1.0 -1.0

## Permutation and Random Sampling

In [93]:
data[(np.abs(data) > 3)]

      0   1   2   3
0   NaN NaN NaN NaN
1   NaN NaN NaN NaN
2   NaN NaN NaN NaN
3   NaN NaN NaN NaN
4   NaN NaN NaN NaN
..   ..  ..  ..  ..
995 NaN NaN NaN NaN
996 NaN NaN NaN NaN
997 NaN NaN NaN NaN
998 NaN NaN NaN NaN
999 NaN NaN NaN NaN

[1000 rows x 4 columns]

In [96]:
df = pd.DataFrame(np.arange(5 * 4).reshape((5, 4)))

In [97]:
sampler = np.random.permutation(5)
sampler

array([2, 4, 0, 3, 1])

In [98]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [99]:
df.take(sampler)

    0   1   2   3
2   8   9  10  11
4  16  17  18  19
0   0   1   2   3
3  12  13  14  15
1   4   5   6   7

In [100]:
df.sample(n=3)

    0   1   2   3
4  16  17  18  19
3  12  13  14  15
2   8   9  10  11

In [101]:
choices = pd.Series([5, 7, -1, 6, 4])

In [102]:
draws = choices.sample(n=10, replace=True)

In [103]:
draws

0    5
0    5
3    6
3    6
3    6
4    4
0    5
2   -1
1    7
4    4
dtype: int64

## Dummy Variables

In [104]:
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],'data1': range(6)})

In [105]:
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [106]:
dummies = pd.get_dummies(df['key'], prefix='key')
df_with_dummy = df[['data1']].join(dummies)
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0